MIT Лицензия

Авторские права (c) 2025 Алексей Дмитриевич Шиляев, Infeon

Настоящим предоставляется разрешение, бесплатно, любому лицу, получившему копию этого программного обеспечения и сопроводительных файлов документации (в дальнейшем "Программное обеспечение"), использовать Программное обеспечение без ограничений, включая, но не ограничиваясь правом на использование, копирование, модификацию, слияние, публикацию, распространение, сублицензирование и/или продажу копий Программного обеспечения, а также разрешение передавать Программное обеспечение другим лицам, при соблюдении следующих условий:

- Уведомление о праве авторства и данное разрешение должны быть включены в копии или существенные части Программного обеспечения.
- Программное обеспечение предоставляется "как есть", без каких-либо гарантий, явных или подразумеваемых, включая, но не ограничиваясь, гарантии товарной пригодности и пригодности для конкретной цели. В любом случае авторы или правообладатели не несут ответственности за любые претензии, ущерб или другие обязательства, будь то в действии контракта, деликте или иных правовых теориях, возникающих из, в связи с или при использовании Программного обеспечения.
